schreibfaul1/ESP32-MiniWebRadio/src/common.h
// created: 10.Feb.2022
// updated: 06.Jum.2025

#pragma once
#pragma GCC optimize("Os") // optimize for code size
// clang-format off
#define _SSID                   "mySSID"                        // Your WiFi credentials here
#define _PW                     "myWiFiPassword"                // Or in textfile on SD-card
#define TFT_CONTROLLER          7                               // (0)ILI9341, (3)ILI9486, (4)ILI9488, (5)ST7796, (7) RGB display
#define DISPLAY_INVERSION       0                               // only SPI displays, (0) off (1) on
#define TFT_ROTATION            1                               // only SPI displays, 1 or 3 (landscape)
#define TFT_FREQUENCY           40000000                        // only SPI displays, 80000000, 40000000, 27000000, 20000000, 10000000
#define TP_VERSION              5                               // only SPI displays, (0)ILI9341, (3)ILI9486, (4)ILI9488, (5)ST7796, (7)GT911
#define TP_ROTATION             1                               // only SPI displays, 1 or 3 (landscape)
#define TP_H_MIRROR             0                               // only SPI displays, (0) default, (1) mirror up <-> down
#define TP_V_MIRROR             0                               // only SPI displays, (0) default, (1) mittor left <-> right
#define I2S_COMM_FMT            0                               // (0) MAX98357A PCM5102A CS4344, (1) LSBJ (Least Significant Bit Justified format) PT8211
#define SDMMC_FREQUENCY         80000000                        // 80000000 or 40000000 Hz
#define FTP_USERNAME            "esp32"                         // user and pw in FTP Client
#define FTP_PASSWORD            "esp32"
#define CONN_TIMEOUT            2500                            // unencrypted connection timeout in ms (http://...)
#define CONN_TIMEOUT_SSL        3500                            // encrypted connection timeout in ms (https://...)
#define WIFI_TX_POWER           5                               // 2 ... 21 (dBm) Adjust the WiFi transmission power to optimise power consumption or increase range, default: 5
#define LIST_TIMER              5                               // After this time (seconds), the display returns from the list view
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

#include <Arduino.h>
#include "esp_log.h"
#include <ArduinoOTA.h>
#include <Preferences.h>
#include <Ticker.h>
#include <SPI.h>
#include <SD_MMC.h>
#include <FS.h>
#include <FFat.h>
#include <Wire.h>
#include <ESPmDNS.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
#include <WiFiMulti.h>
#include <vector>
#include "websrv.h"
#include "rtime.h"
#include "IR.h"
#include "tft_spi.h"
#include "tft_rgb.h"
#include "tp_xpt2046.h"
#include "tp_gt911.h"
#include "SPIFFS.h"
#include "ESP32FtpServer.h"
#include "Audio.h"
#include "DLNAClient.h"
#include "KCX_BT_Emitter.h"
#include "BH1750.h"
#include "base64.h"
#include <mbedtls/aes.h>
#include "mbedtls/sha1.h"
#include <mbedtls/base64.h>





#if TFT_CONTROLLER < 7
    // Digital I/O used
        #define TFT_CS              8
        #define TFT_DC             12
        #define TFT_BL             10 // at -1 the brightness menu is not displayed
        #define TP_IRQ             39
        #define TP_CS              15
        #define SD_MMC_D0          11
        #define SD_MMC_CLK         13
        #define SD_MMC_CMD         14
        #define IR_PIN              4  // IR Receiver (if available)
        #define TFT_MOSI           18  // TFT and TP (FSPI)
        #define TFT_MISO            2  // TFT and TP (FSPI)
        #define TFT_SCK            17  // TFT and TP (FSPI)

        #define I2S_DOUT            9
        #define I2S_BCLK            3
        #define I2S_LRC             1
        #define I2S_MCLK            0

        #define BT_EMITTER_RX      45  // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      38  // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_LINK    19  // high if connected                     (-1 if not available)
        #define BT_EMITTER_MODE    20  // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 48  // high impulse -> awake after POWER_OFF (-1 if not available)

        #define I2C_SDA            41  // I2C, dala line for capacitive touchpad
        #define I2C_SCL            42  // I2C, clock line for capacitive touchpad
#endif

#if TFT_CONTROLLER == 7 // RGB display

const TFT_RGB::Pins RGB_PINS = {  // SUNTON 7"
    .b0 = 15,
    .b1 = 7,
    .b2 = 6,
    .b3 = 5,
    .b4 = 4,
    .g0 = 9,
    .g1 = 46,
    .g2 = 3,
    .g3 = 8,
    .g4 = 16,
    .g5 = 1,
    .r0 = 14,
    .r1 = 21,
    .r2 = 47,
    .r3 = 48,
    .r4 = 45,
    .hsync = 39,
    .vsync = 40,
    .de = 41,
    .pclk = 42,
    .bl = 2
};

const TFT_RGB::Timing RGB_TIMING = {
    .h_res = 800,
    .v_res = 480,
    .pixel_clock_hz = 10000000,
    .hsync_pulse_width = 30,
    .hsync_back_porch = 16,
    .hsync_front_porch = 210,
    .vsync_pulse_width = 13,
    .vsync_back_porch = 10,
    .vsync_front_porch = 22
};

#define TP_SDA 19
#define TP_SCL 20
#define TP_IRQ -1

#define SD_MMC_CMD         11
#define SD_MMC_CLK         12
#define SD_MMC_D0          13

#define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-frequency
#define GT911_I2C_ADDRESS  0x5D   // default I2C-address of GT911

#define I2S_DOUT           17
#define I2S_BCLK           0
#define I2S_LRC            18
#define I2S_MCLK           -1  // important!

#define IR_PIN             38  // IR Receiver (if available)
#define BT_EMITTER_RX      -1  // must be -1, not enough pins
#define BT_EMITTER_TX      -1  // must be -1, not enough pins
#define BT_EMITTER_LINK    -1  // must be -1, not enough pins
#define BT_EMITTER_MODE    -1  // must be -1, not enough pins
#define BT_EMITTER_CONNECT -1  // must be -1, not enough pins

#define TFT_BL              2  // same as RGB_PINS.bl

#define I2C_SDA            19  // I2C line, same as dala line for capacitive touchpad  (-1 if not used) can be used for brightness sensor
#define I2C_SCL            20  // I2C line, same as clock line for capacitive touchpad (-1 if not used) can be used for brightness sensor



#endif

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// output on serial terminal
#define ANSI_ESC_RESET          "\033[0m"
#define ANSI_ESC_BLACK          "\033[30m"
#define ANSI_ESC_RED            "\033[31m"
#define ANSI_ESC_GREEN          "\033[32m"
#define ANSI_ESC_YELLOW         "\033[33m"
#define ANSI_ESC_BLUE           "\033[34m"
#define ANSI_ESC_MAGENTA        "\033[35m"
#define ANSI_ESC_CYAN           "\033[36m"
#define ANSI_ESC_WHITE          "\033[37m"

#define ANSI_ESC_GREY           "\033[90m"
#define ANSI_ESC_LIGHTRED       "\033[91m"
#define ANSI_ESC_LIGHTGREEN     "\033[92m"
#define ANSI_ESC_LIGHTYELLOW    "\033[93m"
#define ANSI_ESC_LIGHTBLUE      "\033[94m"
#define ANSI_ESC_LIGHTMAGENTA   "\033[95m"
#define ANSI_ESC_LIGHTCYAN      "\033[96m"
#define ANSI_ESC_LIGHTGREY      "\033[97m"

#define ANSI_ESC_DARKRED        "\033[38;5;52m"
#define ANSI_ESC_DARKGREEN      "\033[38;5;22m"
#define ANSI_ESC_DARKYELLOW     "\033[38;5;136m"
#define ANSI_ESC_DARKBLUE       "\033[38;5;17m"
#define ANSI_ESC_DARKMAGENTA    "\033[38;5;53m"
#define ANSI_ESC_DARKCYAN       "\033[38;5;23m"
#define ANSI_ESC_DARKGREY       "\033[38;5;240m"

#define ANSI_ESC_BROWN          "\033[38;5;130m"
#define ANSI_ESC_ORANGE         "\033[38;5;214m"
#define ANSI_ESC_DARKORANGE     "\033[38;5;166m"
#define ANSI_ESC_LIGHTORANGE    "\033[38;5;215m"
#define ANSI_ESC_PURPLE         "\033[38;5;129m"
#define ANSI_ESC_PINK           "\033[38;5;213m"
#define ANSI_ESC_LIME           "\033[38;5;190m"
#define ANSI_ESC_NAVY           "\033[38;5;25m"
#define ANSI_ESC_AQUAMARINE     "\033[38;5;51m"
#define ANSI_ESC_LAVENDER       "\033[38;5;189m"

#define ANSI_ESC_LIGHTBROWN     "\033[38;2;210;180;140m"

