schreibfaul1/ESP32-MiniWebRadio/src/common.h
#define ANSI_ESC_RESET          "\033[0m"
#define ANSI_ESC_BOLD           "\033[1m"
#define ANSI_ESC_FAINT          "\033[2m"
#define ANSI_ESC_ITALIC         "\033[3m"
#define ANSI_ESC_UNDERLINE      "\033[4m"
#define ANSI_ESC_BLINK          "\033[5m"
#define ANSI_ESC_INVERT         "\033[7m"
#define ANSI_ESC_STRIKE         "\033[9m"

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
struct _emojis{
    const char  greenCircle[5]   = {0xF0, 0x9F, 0x9F, 0xA2, 0x00};     // UTF-8: "🟢"
    const char  yellowCircle[5]  = {0xF0, 0x9F, 0x9F, 0xA1, 0x00};     // UTF-8: "🟡"
    const char  redCircle[5]     = {0xF0, 0x9F, 0x94, 0xB4, 0x00};     // UTF-8: "🔴"
    const char  blueCircle[5]    = {0xF0, 0x9F, 0x94, 0xB5, 0x00};     // UTF-8: "🔵"
    const char  orangeCircle[5]  = {0xF0, 0x9F, 0x9F, 0xA0, 0x00};     // UTF-8: "🟠"
    const char  purpleCircle[5]  = {0xF0, 0x9F, 0x9F, 0xA3, 0x00};     // UTF-8: "🟣"
    const char  brownCircle[5]   = {0xF0, 0x9F, 0x9F, 0xA4, 0x00};     // UTF-8: "🟤"
    const char  greenSquare[5]   = {0xF0, 0x9F, 0x9F, 0xA9, 0x00};     // UTF-8: "🟩"
    const char  yellowSquare[5]  = {0xF0, 0x9F, 0x9F, 0xA8, 0x00};     // UTF-8: "🟨"
    const char  redSquare[5]     = {0xF0, 0x9F, 0x9F, 0xA5, 0x00};     // UTF-8: "🟥"
    const char  blueSquare[5]    = {0xF0, 0x9F, 0x9F, 0xA6, 0x00};     // UTF-8: "🟦"
    const char  orangeSquare[5]  = {0xF0, 0x9F, 0x9F, 0xA7, 0x00};     // UTF-8: "🟧"
    const char  purpleSquare[5]  = {0xF0, 0x9F, 0x9F, 0xAA, 0x00};     // UTF-8: "🟪"
    const char  brownSquare[5]   = {0xF0, 0x9F, 0x9F, 0xAB, 0x00};     // UTF-8: "🟫"
} emoji;
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
enum status {
    NONE = 0,
    RADIO = 1,
    PLAYER = 2,
    DLNA = 3,
    CLOCK = 4,
    BRIGHTNESS = 5,
    ALARMCLOCK = 6,
    SLEEPTIMER = 7,
    STATIONSLIST = 8,
    AUDIOFILESLIST = 9,
    DLNAITEMSLIST = 10,
    BLUETOOTH = 11,
    EQUALIZER = 12,
    SETTINGS = 13,
    IR_SETTINGS = 14,
    RINGING = 15,
    WIFI_SETTINGS = 16,
    UNDEFINED = 255
};

static bool _newLine = false;
extern SemaphoreHandle_t mutex_rtc;
extern RTIME rtc;

extern WebSrv webSrv;
extern std::deque<ps_ptr<char>> s_logBuffer;
void SerialPrintfln(const char* fmt, ...){
    ps_ptr<char>myLog("myLog");
    if(_newLine){_newLine = false; myLog.assign("\n");} else{myLog.assign("");}
    rtc.hasValidTime()? myLog.append(rtc.gettime_s()) : myLog.append("00:00:00");
    myLog.append(" ");
    va_list args;
    va_start(args, fmt);
    myLog.appendf_va(fmt, args);
    va_end(args);
    myLog.append("\033[0m\r\n");
    Serial.printf("%s", myLog.c_get());
    s_logBuffer.insert(s_logBuffer.begin(), std:: move(myLog)); // send to webSrv in loop()
    myLog.reset();
}

void SerialPrintfcr(const char* fmt, ...){
    if(s_logBuffer.size() == 1024) s_logBuffer.pop_back();
    ps_ptr<char>myLog("myLog");
    rtc.hasValidTime()? myLog.assign(rtc.gettime_s()) : myLog.assign("00:00:00");
    myLog.append(" ");
    va_list args;
    va_start(args, fmt);
    myLog.appendf_va(fmt, args);
    va_end(args);
    myLog.append("\033[0m\r");
    Serial.printf("%s", myLog.c_get());
    s_logBuffer.insert(s_logBuffer.begin(), std:: move(myLog));// send to webSrv in loop()
    myLog.reset();
    _newLine = true;
}

int log_redirect_handler(const char *format, va_list args) {
    int len = vsnprintf(nullptr, 0, format, args) + 1;
    // Puffer für die formatierte Nachricht
    ps_ptr<char>log_buffer("log_buffer");
    log_buffer.alloc(len);
    vsnprintf(log_buffer.get(), len, format, args);
    if (len > 0) {
        int idx = log_buffer.index_of("ARDUINO:");
        if(idx > 0){
            char c = log_buffer[7];
            log_buffer.remove_before(idx, true);
            log_buffer.insert("    ", 8);
            if(c == 'E') log_buffer.insert(ANSI_ESC_RED, 10);
            if(c == 'W') log_buffer.insert(ANSI_ESC_YELLOW, 10);
            if(c == 'I') log_buffer.insert(ANSI_ESC_GREEN, 10);
            if(c == 'D') log_buffer.insert(ANSI_ESC_CYAN, 10);
            if(c == 'V') log_buffer.insert(ANSI_ESC_GREY, 10);
            log_buffer.truncate_at(log_buffer.strlen() -1); // remove '\n'
            SerialPrintfln("%s", log_buffer.c_get());
        }
        else{
            SerialPrintfln("%s", log_buffer.c_get());
        }
    }return 0;
}

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
struct dlnaHistory {
    char*    objId = NULL;
    char*    name = NULL;
    uint16_t maxItems = 0;
};
struct releasedArg {
    char*   arg1 = NULL;
    char*   arg2 = NULL;
    char*   arg3 = NULL;
    int16_t val1 = 0;
    int16_t val2 = 0;
};
struct timecounter {
    uint8_t timer = 0;
    uint8_t factor = 2;
};
struct irButtons {
    int16_t val;
    char*   label;
};
typedef struct __settings{
    irButtons irbuttons[45];
    uint8_t numOfIrButtons = 0;
    ps_ptr<char>lastconnectedhost = {};
    ps_ptr<char>lastconnectedfile = {};
} settings_t;

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

// clang-format on
// prototypes (main.cpp)
boolean        defaultsettings();
void           updateSettings();
void           urldecode(char* str);
const char*    SD_stringifyDirContent(String path);
void           setTFTbrightness(uint8_t duty);
void           fall_asleep();
void           wake_up();
void           setRTC(const char* TZString);
boolean        isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime);
boolean        copySDtoFFat(const char* path);
void           showStreamTitle(const char* streamTitle);
void           showLogoAndStationName(bool force);
void           showFileLogo(uint8_t state);
void           showFileName(const char* fname);
void           showPlsFileNumber();
void           showAudioFileNumber();
void           display_sleeptime(int8_t ud = 0);
boolean        drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth = 0, uint16_t maxHeigth = 0);
boolean        isAudio(File file);
boolean        isAudio(const char* path);
boolean        isPlaylist(File file);
bool           connectToWiFi();
void           setWiFiCredentials(const char* ssid, const char* password);
const char*    scaleImage(const char* path);
void           setVolume(uint8_t vol);
uint8_t        downvolume();
uint8_t        upvolume();
void           setStation(uint16_t sta);
const char*    getFlagPath(uint16_t station);
void           nextStation();
void           prevStation();
void           setStationByNumber(uint16_t staNr);
void           StationsItems();
void           setStationViaURL(const char* url, const char* extension);
void           savefile(const char* fileName, uint32_t contentLength);
String         setI2STone();
void           SD_playFile(const char* pathWoFileName, const char* fileName);
void           SD_playFile(const char* path, uint32_t resumeFilePos = 0, bool showFN = true);
bool           SD_rename(const char* src, const char* dest);
bool           SD_newFolder(const char* folderPathName);
bool           SD_delete(const char* itemPath);
bool           preparePlaylistFromDLNAFolder();
bool           preparePlaylistFromFile(const char* path);
bool           preparePlaylistFromSDFolder(const char* path);
void           sortPlayListAlphabetical();
void           sortPlayListRandom();
void           processPlaylist(boolean first = false);
void           changeState(int32_t state);
void           connecttohost(const char* host);
void           connecttoFS(const char* FS, const char* filename, uint32_t fileStartTime = 0);
void           stopSong();
void           placingGraphicObjects();
void           muteChanged(bool m);
void           BTpowerChanged(int8_t newState); // true -> power on, false -> power off
void           setTimeCounter(uint8_t sec);
const char*    getWiFiPW(const char* ssid);
bool           setWiFiPW(const char* ssid, const char* password);
void           my_audio_info(Audio::msg_t m);
void           on_dlna_client(const DLNA_Client::msg_s& msg);

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline const char* byte_to_binary(int8_t x) { // e.g. alarmdays
    static char b[9];
    b[0] = '\0';

